# EnableSnaps Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ImageInstance..::..EnableSnaps Property
ImageInstance Class See Also
---
When true the ImageInstance will have its snaps enabled, but only if CanHaveSnaps is true
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public bool EnableSnaps { get; set; }
```

Visual Basic
---
```text
Public Property EnableSnaps As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool EnableSnaps {
	bool get ();
	void set (bool value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The image does not have snaps |

# See Also
ImageInstance Class
Autodesk.Revit.DB Namespace